

scales = {
    'groups': ["CAU", "IPC-SSC"],
    'N': ["משתתפים פעילים", "פספוסי גיוסים", 'אין שת"פ טיפולי', "אי התאמה למחקר", "אי הסכמה למחקר",
          "סיימו טיפול", "נשירה מחקרית", "נשירה קלינית- לאחר ת. טיפול", "עלייה לרמה 2"],

    # התאמה למחקר

    ## אותו דבר בלי: טבלת אי-התאמה למחקר, ובלי פיספוסי גיוסים 

    'research-fit': ["משתתפים פעילים", "פספוסי גיוסים", 'אין שת"פ טיפולי', "אי התאמה למחקר", "אי הסכמה למחקר",
                     "סיימו טיפול", "נשירה מחקרית", "נשירה קלינית- לאחר ת. טיפול", "עלייה לרמה 2"],
    'research-fit_v2': ["משתתפים פעילים", "פספוסי גיוסים", 'אין שת"פ טיפולי', "אי התאמה למחקר", "אי הסכמה למחקר",
                        "סיימו טיפול", "נשירה מחקרית", "נשירה קלינית- לאחר ת. טיפול", "עלייה לרמה 2"],

}


SHEET_NAMES = ['משתתפים פעילים sheet',
       'פספוסי גיוסים sheet',
               'אין שת"פ טיפולי sheet',
               'אי התאמה למחקר sheet',
       'אי הסכמה למחקר sheet',
               'Care as usual sheet',
               'IPC-SSC sheet',
       'סיימו טיפול sheet',
               'נשירה מחקרית sheet',
       'נשירה קלינית- לאחר ת. טיפול sheet',
               'עלייה לרמה 2 sheet']


fix_to_ipc = ['h4481', 'm2211', 'm1242', 'g9817']
dates_cols = ['תאריך פנייה למרפאה',
              'תאריך אינטייק',
              'תאריך תחילת התערבות',
              'תאריך חתימה']

GROUP_COLUMNS = ['CAU group', 'Stepped Care group']

ID_COL = 'id'

WAITING_COL = 'waiting_time'
